cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/cask-fonts"

brew "coreutils"
brew "git"
brew "gradle"
brew "htop"
brew "ispell"
brew "jq"
brew "ledger"
brew "nvm"
brew "pyenv"
brew "python3"
brew "rename"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "unrar"
brew "wget"
brew "zsh-autosuggestions"
cask "1password"
cask "adoptopenjdk"
cask "anki"
cask "caffeine"
cask "discord"
cask "docker"
cask "emacs"
cask "evernote"
cask "font-iosevka-slab"
cask "google-backup-and-sync"
cask "google-chrome"
cask "handbrake"
cask "intellij-idea-ce"
cask "iterm2"
cask "java"
cask "mtmr"
cask "notion"
cask "obs"
cask "sizeup"
cask "spotify"
cask "tunnelblick"
cask "zoomus"